package ru.devyandex.investmenthelper.constants

object Constants {
    const val WELCOME_MESSAGE = "Вас приветствует торговый робот. Для взаимодействия с роботом используйте меню."
    const val ENTER_TOKEN_MESSAGE = "Пожалуйста, введите токен для вашего аккаунта в Тинькофф Инвестициях. " +
            "Его можно сгенерировать в личном кабинете Тинькофф Инвестиций."
    const val INVALID_TOKEN_MESSAGE = "Ваш токен неверен, попробуйте снова."
    const val CHOICE_STRATEGY_MESSAGE = "Выберите торговую стратегию для робота."
    const val HELP_MESSAGE = "Для запуска торгового робота необходимо предоставить токен для взаимодействия с API " +
            "Тинькофф Инвестиций после команды \"Запустить торгового робота\". После этого необходимо выбрать торговую " +
            "стратегию из предложенных."
}